app/Models/ModelUser.php

    public function cek_login($username)
    {
        return $this->db->table('tbl_user')->where(array('nama_user'=>$username))->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `nama_user` = 'Maulana'