app/Models/ModelKasKeluar.php

    public function insertData($data)
    {
        $this->db->table('tbl_kas_mesjid')->insert($data);
---
INSERT INTO `tbl_kas_mesjid` (`tanggal`, `ket`, `kas_keluar`, `kas_masuk`, `jenis_kas`, `status`) VALUES (NULL, NULL, NULL, 0, 'Anak Yatim', 'Keluar')